Tekla Open API Reference for Tekla Structures 2025
Symbol.SymbolAttributes.PreferredPlacing Property
 The type of placing the object should use. See the preferred placing types for different types of placing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PreferredPlacingTypeBase PreferredPlacing { get; set; }
Public Property PreferredPlacing As PreferredPlacingTypeBase
	Get
	Set
Property Value
Type: PreferredPlacingTypeBase
Implements
IPreferredPlacing.PreferredPlacing
See Also
Reference
Symbol.SymbolAttributes Class
Tekla.Structures.Drawing Namespace